/**
 * Hailiang.com Inc.
 * Copyright (c) 2004-2023 All Rights Reserved.
 */
package labuladong;

/**
 * @author Baojiang Yang
 * @version : A0_算法大纲.java, v 0.1 2023年11月18日 19:53  Baojiang Yang Exp $
 */
public class A0_算法大纲 {

    /**
     * 算法学习大纲
     * 一.数据结构
     *    1.数组
     *    2.链表
     *    3.栈
     *    4.队列
     *    5.Tree
     *    6.图
     * 二.解题思路
     *    1.普通型: 简单思维型
     *    2.技巧型: 单指针
     *             双指针: 左右指针(二分查找),快慢指针,上下指针(子列存在问题), 滑动窗口(最值问题)
     *    3.二叉树型:
     *              DFS: 属于遍历的思路，它的关注点在单个「节点」,DFS可以归纳到下边回溯算法里。
     *              回溯(Backtrace):便利一遍就能二叉树得出答案,没有返回值,前序做选择,后序撤销选择,它的关注点在节点间的「树枝」。
     *                  适用: 排列,组合,子集,岛屿问题
     *              动态规划(Dynamic Programing)或者分治:通过分解子问题得到原问题的答案,有返回值,它的关注点在整棵「子树」。
     *                  适用: fib, 凑零钱,打家劫舍
     *              无论哪一种模式: 你都要明白二叉树的每一个节点需要做什么，需要在什么时候（前中后序）做
     * 三.实现算法
     *
     * 四.优化算法
     *
     */
}